In [1]:
import pandas as pd

## Read from csv

In [4]:
!pwd

/Users/robert/Documents/repos/python-for-data-science/classes

In [3]:
!ls

01 - Extraction.ipynb

In [6]:
df = pd.read_csv('../titanic/train.csv')

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
a = []
for x in df.PassengerId:
    if x > 10:
        a.append(x + 1)

In [19]:
# List comprehension
a = [x + 1 for x in df.PassengerId if x > 10]

In [23]:
a = (df.PassengerId + 1).tolist()

In [21]:
type(df['PassengerId'] + 1)

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

## Read from excel

In [24]:
df = pd.read_excel('../Employee data.xls')

In [38]:
df.head()

,id,gender,bdate,educ,jobcat,salary,salbegin,jobtime,prevexp,minority
0,1,m,1952-02-03,15,3,57000,27000,98,144,0
1,2,m,1958-05-23,16,1,40200,18750,98,36,0
2,3,f,1929-07-26,12,1,21450,12000,98,381,0
3,4,f,1947-04-15,8,1,21900,13200,98,190,0
4,5,m,1955-02-09,15,1,45000,21000,98,138,0

## Database

In [27]:
import sqlite3

In [40]:
conn = sqlite3.connect('flights.db')

In [43]:
with open('../query.sql') as f:
    query = f.read().strip()

In [44]:
query

'SELECT * FROM airports'

In [42]:
df = pd.read_sql_query(query, conn)

In [46]:
from sqlalchemy import create_engine

uri = 'mongodb://ufk2vps0a7j:p7bb9de7d5fa58cb72a105ae756813ba7' \
      '@ec2-38-129-168-191.compute-1.amazonaws.com:5432/deu4neob640'

In [ ]:
engine = create_engine(uri)
conn = engine.raw_connection()

In [ ]:
df = pd.read_sql_query(query, conn)

## API

In [20]:
import requests

In [51]:
api_key = '3e354e20d299abac4a6d28b3857a28ce'
endpoint = f'''
    http://www.apilayer.net/api/live
    ? access_key = {api_key}
    & source = USD
    & format = 1
'''

In [52]:
endpoint = endpoint.replace(' ', '').replace('\n','')

In [56]:
endpoint

'http://www.apilayer.net/api/live?access_key=3e354e20d299abac4a6d28b3857a28ce&source=USD&format=1'

In [53]:
response = requests.get(endpoint)

In [54]:
response.status_code, response.reason

(200, 'OK')

In [57]:
import json
data = json.loads(response.content)

In [92]:
import pandas as pd
df = pd.DataFrame(data).reset_index().rename(columns={'index': 'currency'})

In [71]:
df['currency'] = df.index

In [72]:
df.head()

,success,terms,privacy,timestamp,source,quotes,currency
USDAED,True,https://currencylayer.com/terms,https://currencylayer.com/privacy,1565366886,USD,3.672997,USDAED
USDAFN,True,https://currencylayer.com/terms,https://currencylayer.com/privacy,1565366886,USD,80.050210,USDAFN
USDALL,True,https://currencylayer.com/terms,https://currencylayer.com/privacy,1565366886,USD,107.929714,USDALL
USDAMD,True,https://currencylayer.com/terms,https://currencylayer.com/privacy,1565366886,USD,476.129742,USDAMD
USDANG,True,https://currencylayer.com/terms,https://currencylayer.com/privacy,1565366886,USD,1.785650,USDANG

# Web Scraping

## BeautifulSoup

In [94]:
import requests

In [95]:
response = requests.get('https://www.cntraveler.com/gallery/best-bars-in-paris')

In [96]:
response.status_code

200

In [99]:
from bs4 import BeautifulSoup

In [102]:
html = BeautifulSoup(response.content, 'lxml')

In [150]:
restaurants = html.find_all('section', {
    'class': 'gallery-item'
})

In [154]:
restaurants[0].find('h2').text

'Bisou'

In [145]:
restaurants[0].find('source').attrs['srcset']

'https://media.cntraveler.com/photos/5a81e9a486e4b63c297d47a9/master/w_820,c_limit/Bisou14-%25C2%25A9-Ronan-Le-May.jpg'

In [168]:
print(restaurants[10].find('source'))

None

In [190]:
restaurants[-1].find('div', {'class': 'dek'}).text

'The outside of this bar is so nondescript—with graffiti and posters covering the doors, which are devoid of any signage—you may walk right past it. But once inside you\'ll feel as if you\'ve entered a recording studio circa 1977. There\'s an unfinished, raw feeling—from exposed sheetrock on the walls to the sound proofing on the ceiling to the gold curtains sectioning the small space. The focus is on drinks made exclusively from French spirits and liqueurs. Case in point: on one visit, the bar was serving "Drop the Beet," made with Normandy Calvados, beet purée, honey syrup, and fresh lemon juice (it\'s super beet-y and practically a meal in itself!) and the "Saix en Provence" made with brandy from Armagnac, spicy watermelon syrup, and lavender essence.'

In [181]:
data = []
for r in restaurants:
    data.append({
        'name': r.find('h2').text,
        'price': r.find('p', {'class': 'price'}).text,
        'description': r.find('div', {'class': 'dek'}).text,
        'image_url': r.find('source').attrs['srcset'] if r.find('source') else None
    })

In [188]:
df = pd.DataFrame(data)

In [194]:
df.head()

,description,image_url,name,price
0,There's no menu at this small bar off the boul...,https://media.cntraveler.com/photos/5a81e9a486...,Bisou,$$
1,Located just around the corner from Septime—of...,https://media.cntraveler.com/photos/5cf978fd66...,Septime La Cave,$$
2,"Since opening in the haute Marais in 2013, it’...",https://media.cntraveler.com/photos/5a80a85da2...,Le Mary Celeste,$$
3,In a time when so many other Parisian bars hav...,None,Au Rendez-Vous des Amis,$$
4,Despite having received a facelift after a mul...,https://media.cntraveler.com/photos/5ab293f060...,Bar Hemingway,$$

In [187]:
pprint(data[10])

{'description': 'Nico de Soto is something of a cocktail legend: After getting '
                'his start with the Experimental Cocktail Group (and winning '
                'various awards, including Most Influential Bartender at '
                "Paris's Cocktail & Spirits show in 2014), he opened his own "
                'joint in New York, called Mace. Danico is his first piloted '
                "project back on his home turf and it's a definite winner. "
                'While the menu changes seasonally, its easy-to-digest format '
                'does not: Each of the 12 cocktails come with descriptions (in '
                'English) that show how the drink is served (shaken, '
                'carbonated, stirred, etc.) and how it tastes ("smoky and '
                'silky," "bitter and tropical," "blue and smurfy," etc.) The '
                'last time we visited, the muralist Supakitch had drawn quirky '
                'illustrations to accompany each drink, like one of a young '
                'Macaulay Culkin for the Home Alone (made with spiced mulled '
                'wine and Prosecco) or Elvis Presley for the Elvis Parsley '
                '(with cachaca, rum, banana, parsley and absinthe).',
 'image_url': None,
 'name': 'Danico',
 'price': '$$'}

In [193]:
print(restaurants[-4].prettify())

<section class="gallery-item gallery-item-venue" data-reactid="528">
 <div class="gallery-item-image__container" data-reactid="529">
  <div class="component-lazy pending" data-component="Lazy" data-reactid="530">
  </div>
 </div>
 <p class="credit" data-reactid="531">
  Maxime Prangé
 </p>
 <div data-reactid="532">
  <div class="image-content-container" data-reactid="533">
   <p class="type" data-reactid="534">
    bar
   </p>
   <a data-reactid="535" href="/bars/paris/little-red-door">
    <h2 class="hed" data-reactid="536">
     Little Red Door
    </h2>
   </a>
   <div class="ratings" data-reactid="537">
    <p class="price" data-reactid="538">
     $$
    </p>
   </div>
   <div class="dek" data-reactid="539">
    <div data-reactid="540">
     <p data-reactid="541">
      Opened by Experimental Cocktail Club protégée Timothée Prangé and Dotan Shalev (who also own the newer Lulu White in Pigalle), the drinks here are beyond clever and well thought-out. The menu itself is an actual work of art with each of the 14 cocktails getting a two-page illustrative treatment by a local artist. Only the drink’s name is listed, though, as they encourage cocktail aficionados to be brave guess the ingredients upon the first taste. (But for those who don’t want to risk it, there is a card that pulls out revealing what’s inside.) They update the menu about twice a year—on a recent visit, when the offerings were part of the "Evocative Menu," you might've have found such concoctions as the Madre de Dios made with tequila, Grand Marnier, Lillet Blanc and carrot seed. Drinks are served in all sorts of vessels from vintage glassware to quirky porcelain bust mugs.
     </p>
    </div>
   </div>
  </div>
 </div>
</section>

In [ ]:
restaurants[0].

In [111]:
restaurants[0]

<div class="image-content-container" data-reactid="155"><p class="type" data-reactid="156">bar</p><a data-reactid="157" href="/bars/paris/bisou"><h2 class="hed" data-reactid="158">Bisou</h2></a><div class="ratings" data-reactid="159"><p class="price" data-reactid="160">$$</p></div><div class="dek" data-reactid="161"><div data-reactid="162"><p data-reactid="163">There's no menu at this small bar off the boulevard in the Haute Marais. It's all about what you like—and what the bartender feels like making. You discuss your liquor and flavors of choice with whomever's shaking things up, and voilà! A mysterious cocktail will appear. Considering its small size and romantic vibe, it's best for a date or a small group of friends, largely of the Instagram generation (the bar is done up in Millennial Pink).</p></div></div></div>

In [109]:
html.find_all('div', {
    'class': 'image-content-container'
})

25

In [112]:
html.find_all('img')

[<img alt="Condé Nast Traveler" class="cnt-print-logo" data-reactid="8" src="/images/CNT-50px-regular.svg"/>,
 <img alt="Condé Nast Traveler" class="cntLogo" data-reactid="14" src="/images/CNT-50px-inverse.svg"/>,
 <img alt="Subscribe to CNTraveler" src="https://subscribe.condenet.com/images_covers/cover_travel_100.jpg"/>,
 <img alt="" src="https://media.cntraveler.com/photos/5a159d34bd93c919415ec505/3:2/w_490,c_limit/GettyImages-483654478.jpg"/>,
 <img alt="Bar Hemingway Ritz Hotel Paris" data-reactid="79" src="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/4:3/w_420,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg" title=""/>,
 <img alt="Bisou Paris Bar" data-reactid="152" src="https://media.cntraveler.com/photos/5a81e9a486e4b63c297d47a9/master/w_420,c_limit/Bisou14-%25C2%25A9-Ronan-Le-May.jpg" title=""/>,
 <img alt="Europe, France, Paris, Bar, Septime la Cave" data-reactid="170" src="https://media.cntraveler.com/photos/5cf978fd6640e72581e1d197/master/w_420,c_limit/Septime-La-Cave1.jpg" title=""/>,
 <img alt="Le Mary Celeste Bar Paris" data-reactid="194" src="https://media.cntraveler.com/photos/5a80a85da2fdaf4c74bb5f50/master/w_420,c_limit/Le-Mary-Celeste_Fabien-Voileau_2018_opt-9939.jpg" title=""/>,
 <img alt="Bar Hemingway Ritz Hotel Paris" data-reactid="230" src="https://media.cntraveler.com/photos/5ab293f060ef3f51835c5ca5/master/w_420,c_limit/Bar-Hemingway-%25C2%25A9-Vincent-Leroux-(1).jpg" title=""/>,
 <img alt="Europe, France, Paris, Bar, Le Comptoir Géneral" data-reactid="248" src="https://media.cntraveler.com/photos/5cf979ee6640e76998e1d199/master/w_420,c_limit/Le-Comptoir-Ge%25CC%2581neral_2019_Comptoir-Ge%25CC%2581ne%25CC%2581ral-4-%25C2%25A9Matthieu-Salvaing.jpg" title=""/>,
 <img alt="Moonshiner bar paris" data-reactid="272" src="https://media.cntraveler.com/photos/5a81e9a71eb1e03b9678c16d/master/w_420,c_limit/Moonshiner_DSC_2734.jpg" title=""/>,
 <img alt="Coper Bay Paris Bar" data-reactid="308" src="https://media.cntraveler.com/photos/5a80a8577211e1293261ce4a/master/w_420,c_limit/Copper-Bay__2018_COPPERBAY-3-%25C2%25A9I.Mathie-HD.jpg" title=""/>,
 <img alt="Candelaria Bar Paris" data-reactid="326" src="https://media.cntraveler.com/photos/5a80a85be9c49e2e4d80a376/master/w_420,c_limit/Candelaria__2018_Outside-Candelaria-300-DPI.jpg" title=""/>,
 <img alt="Subscribe to CNTraveler" src="https://subscribe.condenet.com/images_covers/cover_travel_160.jpg"/>]

In [205]:
a = pd.DataFrame({
    'nombre': ['Carlos', 'Robert', 'Eduardo'],
    'edad': [23, 41, 31]
})
a

    nombre  edad
0   Carlos    23
1   Robert    41
2  Eduardo    31

In [206]:
b = pd.DataFrame({
    'nombre': ['Carlos', 'Eduardo', 'Julio'],
    'ciudad': ['Lima', 'Arequipa', 'Trujillo']
})
b

    nombre    ciudad
0   Carlos      Lima
1  Eduardo  Arequipa
2    Julio  Trujillo

In [204]:
pd.merge(a, b, how='outer', on='nombre')

    nombre  edad    ciudad
0   Carlos  23.0      Lima
1   Robert  41.0       NaN
2  Eduardo  31.0  Arequipa
3    Julio   NaN  Trujillo